{
  "filePath": "src\\core\\http\\errors\\spotify-errors.ts",
  "summary": "This TypeScript file, `spotify-errors.ts`, is part of the error handling system for the Spotify SDK. Its main purpose is to define custom error classes that represent different types of errors that can occur when making HTTP requests to the Spotify API. The key functionalities of this file are: 1. **SpotifyErrorData Interface**: This interface defines the structure of the error data that can be associated with a `SpotifyHttpError` instance. It includes properties like the error message, status code, error code, retry duration, and the original error context. 2. **SpotifyHttpError Class**: This is the base error class that extends the built-in `Error` class. It provides a way to create custom error objects with additional metadata, such as the HTTP status code, error code, and the `SpotifyErrorData`. 3. **SpotifyRateLimitError Class**: This class extends the `SpotifyHttpError` class and represents a rate limit error. It includes a `retryAfter` property that indicates the time in seconds that the client should wait before retrying the request. 4. **SpotifyValidationError Class**: This class extends the `SpotifyHttpError` class and represents a validation error. It includes a `validationDetails` property that provides information about the validation errors. 5. **Error Registry**: The file also defines an `ERROR_REGISTRY` constant, which is a mapping of error codes to metadata about those errors. This registry is used by the `getMetadata()` method of the `SpotifyHttpError` class to retrieve additional information about the error. The main purpose of this file is to provide a consistent and structured way of handling and representing different types of errors that can occur when interacting with the Spotify API. By defining these custom error classes, the SDK can provide more detailed and informative error messages to the client applications.",
  "lastUpdated": "2025-01-29T00:29:17.966Z",
  "fileHash": "e6aa5ae3d69132706f8a52bb3945d9de"
}