{
  "filePath": "src\\core\\http\\errors\\types.ts",
  "summary": "This TypeScript file defines the error handling mechanism for a HTTP-based application, specifically targeting the Spotify API. The main purpose of this file is to provide a standardized and consistent way of handling different types of errors that can occur during API interactions. Key functionality: 1. **Error Codes**: It defines a set of constant error codes (`ERROR_CODES`) that can be used to consistently identify different types of errors, such as authentication errors, validation errors, rate-limiting errors, network/server errors, and a generic \"unknown error\". 2. **Error Types**: It introduces the `ErrorCode` type, which is a type alias for the string literals defined in `ERROR_CODES`. This allows for type-safe usage of the error codes throughout the application. 3. **Error Metadata**: It defines the `ErrorTypeMetadata` interface, which provides detailed information about each error type, including the error code, whether the error is retryable, the default error message, the severity level, and the associated HTTP status code. 4. **Validation Errors**: It defines the `ValidationErrors` interface, which represents a detailed structure for validation errors, including missing fields, invalid data types, and custom errors. 5. **Request Context**: It defines the `RequestContext` interface, which holds information about the HTTP request, such as the endpoint, method, parameters, headers, and timestamp. 6. **Error Context**: It defines the `BaseErrorContext` interface, which represents the base context for all errors, including the resource type, resource ID, validation errors, request context, timestamp, correlation ID, and additional data. 7. **Normalized Error**: It defines the `NormalizedError` interface, which represents a standardized error format that includes the error code, message, status code, error context, whether the error is retryable, the timestamp, the error metadata, and the original error object. 8. **Spotify-specific Errors**: It defines the `SpotifyErrorResponse` and `SpotifyErrorData` interfaces, which represent the error response structure specific to the Spotify API, including the error message, status, code, and retry-after information. 9. **Error Registry**: It defines the `ERROR_REGISTRY` object, which is a mapping of error codes to their corresponding `ErrorTypeMetadata` objects, providing a centralized place to define and manage the metadata for each error type. The main purpose of this file is to provide a consistent and scalable error handling mechanism for the application, allowing for easy identification, handling, and reporting of different types of errors that may occur during API interactions.",
  "lastUpdated": "2025-01-29T20:06:16.362Z",
  "fileHash": "dda4826e19576580464892e88d6f7c5a"
}